wegam/STM32F1xWorkSpace/Driver/Components/SCR/R61509V.c
/**************************************************************************************************
* 液晶屏驱动IC
* 文件<$(filename)>
* 模块描述 :	定义、功能、说明
* 历史修改记录
*     <主要修改者>  <时间>   <版本 >   <说明>
*     xlyan        $(Date)   1.0.0    创建文件
**************************************************************************************************/
#include "R61509V.h"
#include "LCD.H"

#include "STM32_GPIO.H"

#include	"stdio.h"			//用于printf
#include	"string.h"		//用于printf
#include	"stdarg.h"		//用于获取不确定个数的参数
#include	"stdlib.h"		//malloc动态申请内存空间

static LCDDef	*pR61509V	=	NULL;		//内部驱动使用，不可删除

#define	R61509V_CS_HIGH		(pR61509V->Port.sCS_PORT->BSRR	= pR61509V->Port.sCS_Pin)
#define	R61509V_CS_LOW		(pR61509V->Port.sCS_PORT->BRR	=	pR61509V->Port.sCS_Pin)

#define	R61509V_DC_HIGH		(pR61509V->Port.sDC_PORT->BSRR	= pR61509V->Port.sDC_Pin)
#define	R61509V_DC_LOW		(pR61509V->Port.sDC_PORT->BRR	= pR61509V->Port.sDC_Pin)

#define	R61509V_WR_HIGH		(pR61509V->Port.sWR_PORT->BSRR	= pR61509V->Port.sWR_Pin)
#define	R61509V_WR_LOW		(pR61509V->Port.sWR_PORT->BRR	= pR61509V->Port.sWR_Pin)

#define	R61509V_RD_HIGH		(pR61509V->Port.sRD_PORT->BSRR	= pR61509V->Port.sRD_Pin)
#define	R61509V_RD_LOW		(pR61509V->Port.sRD_PORT->BRR	= pR61509V->Port.sRD_Pin)

#define	R61509V_RST_HIGH	(pR61509V->Port.sREST_PORT->BSRR	= pR61509V->Port.sREST_Pin)
#define	R61509V_RST_LOW		(pR61509V->Port.sREST_PORT->BRR	= pR61509V->Port.sREST_Pin)

#define	R61509V_TE_HIGH		(pR61509V->Port.sTE_PORT->BSRR	= pR61509V->Port.sTE_Pin)
#define	R61509V_TE_LOW		(pR61509V->Port.sTE_PORT->BRR	= pR61509V->Port.sTE_Pin)

#define	R61509V_BL_HIGH		(pR61509V->Port.sBL_PORT->BSRR	= pR61509V->Port.sBL_Pin)
#define	R61509V_BL_LOW		(pR61509V->Port.sBL_PORT->BRR	= pR61509V->Port.sBL_Pin)

#define R61509V_DATABUS_PORT	(pR61509V->Port.sDATABUS_PORT)
#define R61509V_DATABUS_Pin		(pR61509V->Port.sDATABUS_Pin)

#define	R61509VSet(n)	R61509V_##n##_HIGH
#define	R61509VCrl(n)	R61509V_##n##_LOW

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
unsigned short R61509V_Initialize(void*	pInfo)
{
	static unsigned short	DeviceCode	=	0;
	LCDPortDef*	Port	=	NULL;
	if(NULL==	pInfo)
		return 0;
	
	pR61509V		=	(LCDDef*)pInfo;		//指针指向
	Port	=	&pR61509V->Port;
	
	//==========================GPIO配置
	GPIO_Configuration_OPP50	(Port->sBL_PORT,				Port->sBL_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sRD_PORT,				Port->sRD_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sREST_PORT,			Port->sREST_Pin);				//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sDC_PORT,				Port->sDC_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sWR_PORT,				Port->sWR_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sCS_PORT,				Port->sCS_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sTE_PORT,				Port->sTE_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sDATABUS_PORT,		Port->sDATABUS_Pin);		//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	
	DeviceCode	=	R61509V_ReadRegister(R61509V_R000_IR);
	if(0xB509	!=	DeviceCode)
	{
		return 0;	//识别失败
	}
	//==========================检查背景色与画笔色是否相同
	if(pR61509V->Data.PColor	==	pR61509V->Data.BColor)
	{
		pR61509V->Data.PColor	=	pR61509V->Data.BColor^0xFFFF;
	}
	
	pR61509V->Data.MaxH	=	R61509V_H;					//最大水平宽度
	pR61509V->Data.MaxV	=	R61509V_V;					//最大垂直高度	
	
	//==========================接口函数
	pR61509V->Display.WriteAddress		=	R61509V_SetWindowAddress;
	pR61509V->Display.PowerOn					=	R61509V_PowerOn;
	pR61509V->Display.DispOff					=	R61509V_PowerOff;
	
	pR61509V->Display.DrawDot					=	R61509V_DrawDot;
	pR61509V->Display.DrawLine				=	R61509V_DrawLine;
	pR61509V->Display.DrawCircle			=	R61509V_DrawCircle;
	pR61509V->Display.DrawRectangle		=	R61509V_DrawRectangle;
	
	pR61509V->Display.Fill						=	R61509V_Fill;
	pR61509V->Display.Clean						=	R61509V_Clean;
	pR61509V->Display.SetBackground		=	R61509V_SetBackground;
	
	pR61509V->Display.ShowChar				=	R61509V_ShowChar;
	pR61509V->Display.ShowWord				=	R61509V_ShowWord;
	
	R61509V_PowerOn();
	R61509V_Clean(pR61509V->Data.BColor);
	
	R61509VSet(BL);
	return DeviceCode;		//配置成功
}
/*******************************************************************************
* 函数名			:	LCD_Reset
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void R61509V_Reset(void)
{
	R61509VSet(RST);
	LCD_DelaymS(5);				//SysTick延时nmS
	R61509VCrl(RST);;
	LCD_DelaymS(5);				//SysTick延时nmS
	R61509VSet(RST);
	LCD_DelaymS(10);				//SysTick延时nmS
}
/*******************************************************************************
* 函数名			:	R61509V_WriteIndex
* 功能描述		:	写指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
unsigned short R61509V_ReadData(void)
{
	unsigned short Data	=	0;
#if	1	//Bus16Bit
	R61509VCrl(RD);	//LCD_RD_LOW;
	Data	=	R61509V_DATABUS_PORT->IDR;
	R61509VSet(RD);	//LCD_RD_HIGH;
#else	
	R61509VCrl(RD);	//LCD_RD_LOW;
	Data	=	R61509V_DATABUS_PORT->IDR;
	R61509VSet(RD);	//LCD_RD_HIGH;
	
	Data	<<=8;
	
	R61509VCrl(RD);	//LCD_RD_LOW;
	Data	|=	R61509V_DATABUS_PORT->IDR;
	R61509VSet(RD);	//LCD_RD_HIGH;
#endif	
	return Data;
}
/*******************************************************************************
* 函数名			:	R61509V_ReadRegister
* 功能描述		:	读指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
unsigned short R61509V_ReadRegister(unsigned	short	Addr)
{
	unsigned short Data	=	0;
	R61509VCrl(CS);	//LCD_CS_LOW;
	//---------------------Write Index
	R61509V_WriteAddr(Addr);
	//---------------------Read Data
	GPIO_Configuration_IPU	(R61509V_DATABUS_PORT,R61509V_DATABUS_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
	Data	=	R61509V_ReadData();
	R61509VSet(CS);	//LCD_CS_HIGH;
	GPIO_Configuration_OPP50	(R61509V_DATABUS_PORT,R61509V_DATABUS_Pin);		//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605	
	return Data;
}
/*******************************************************************************
* 函数名			:	R61509V_WriteIndex
* 功能描述		:	写指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void R61509V_WriteData(unsigned	short	Data)
{
#if	1	//Bus16Bit
	R61509VCrl(WR);	//LCD_WR_LOW;
	R61509V_DATABUS_PORT->ODR = Data;
	R61509VSet(WR);	//LCD_WR_HIGH;
#else
	R61509VCrl(WR);	//LCD_WR_LOW;
	R61509V_DATABUS_PORT->ODR = Data>>8;
	R61509VSet(WR);	//LCD_WR_HIGH;
	
	R61509VCrl(WR);	//LCD_WR_LOW;
	R61509V_DATABUS_PORT->ODR = Data&0xFF;
	R61509VSet(WR);	//LCD_WR_HIGH;
#endif
}
/*******************************************************************************
* 函数名			:	ILI9326_WriteAddr
* 功能描述		:	写指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void R61509V_WriteAddr(unsigned	short	Addr)
{
	R61509VCrl(DC);	//LCD_DC_LOW;		//RS
	R61509V_WriteData(Addr);
	R61509VSet(DC);	//LCD_DC_HIGH;	//RS
}
/*******************************************************************************
* 函数名			:	R61509V_WriteIndex
* 功能描述		:	写指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void R61509V_WriteIndex(unsigned	short	Index)
{
	R61509VCrl(CS);	//LCD_CS_LOW;	
	R61509V_WriteAddr(Index);
	R61509VSet(CS);	//LCD_CS_HIGH;
}
/*******************************************************************************
* 函数名			:	R61509V_WriteRegister
* 功能描述		:	写指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void R61509V_WriteRegister(unsigned	short	Addr,unsigned short Data)
{
	R61509VCrl(CS);	//LCD_CS_LOW;	
	//---------------------Write Index
	R61509V_WriteAddr(Addr);
	//---------------------Write Data
	R61509V_WriteData(Data);	
	R61509VSet(CS);	//LCD_CS_HIGH;	
}
/*******************************************************************************
* 函数名			:	R61509V_WriteCommand
* 功能描述		:	读指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void R61509V_WriteCommand(unsigned	short	Index,unsigned short Cmd)
{
	R61509V_WriteRegister(Index,Cmd);
}
/*******************************************************************************
* 函数名			:	R61509V_WriteGRAM
* 功能描述		:	写指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void R61509V_WriteGRAM(unsigned	short* RAM,unsigned long length)
{
	unsigned	long	i	=	0;
	R61509VCrl(CS);	//LCD_CS_LOW;
	R61509V_WriteAddr(R61509V_R202_GDRW);
	for(i=0;i<length;i++)
	{
		R61509V_WriteData(RAM[i]);
	}
	R61509VSet(CS);	//LCD_CS_HIGH;
}
/*******************************************************************************
* 函数名			:	R61509V_WriteGRAM
* 功能描述		:	写指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void R61509V_ReadGRAM(unsigned	short* RAM,unsigned long length)
{
	unsigned	long	i	=	0;
	R61509VCrl(CS);	//LCD_CS_LOW;
	R61509V_WriteIndex(R61509V_R202_GDRW);
	GPIO_Configuration_IPU	(R61509V_DATABUS_PORT,R61509V_DATABUS_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
	for(i=0;i<length;i++)
	{
		RAM[i]=R61509V_ReadData();
	}
	R61509VSet(CS);	//LCD_CS_HIGH;
	GPIO_Configuration_OPP50	(R61509V_DATABUS_PORT,R61509V_DATABUS_Pin);		//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605	
}
/**************************************************************************************************
* [Function] LCD_PowerOff:  关闭LCD 电源
* [No param]
**************************************************************************************************/
void R61509V_PowerOff( void )
{
	LCD_BL_OFF;		//关背光
	R61509V_WriteCommand( R61509V_R009_DC3, 0 );	
}
/*******************************************************************************
*函数名			:	R61509V_Initialize
*功能描述		:	IC初始化：按照主控芯片R61509V的power supply on sequence 进行配置
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_PowerOn(void)			//按照主控芯片R61509V的power supply on sequence 进行配置
{
	u32 dtime=2000;
	
	void(*Command)(unsigned short Index,unsigned short Command);//LcdDisplay.WriteCommand
	
	void(*DelaymS)(unsigned long xms) = LCD_DelaymS;
	
